Tekla Open API Reference for Tekla Structures 2025
CircleRebarGroup.StirrupType Property
 The type of the stirrup. The options are:
STIRRUP_TYPE_CIRCLE
STIRRUP_TYPE_SPIRAL
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CircleRebarGroup.CircleRebarGroupStirrupTypeEnum StirrupType { get; set; }
Public Property StirrupType As CircleRebarGroup.CircleRebarGroupStirrupTypeEnum
	Get
	Set
Property Value
Type: CircleRebarGroup.CircleRebarGroupStirrupTypeEnum
See Also
Reference
CircleRebarGroup Class
Tekla.Structures.Model Namespace